In [8]:
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns

In [9]:
df= pd.read_csv('Rank-List-attribute.csv')

In [10]:
df.head()

   CET number                    Name  Marks Rank
0   115200463        H R SHREE RAKSHA     72    1
1   103200234        ADITI NARASIMHAN     71    2
2   113200118  DARSHAN PRASHANT HEGDE     70    3
3   149200155         ROHIT KOUJALAGI     68    4
4   101200497             U S ABHIRAM     68    5